app/loadtests/artillery/test.yml
config:
  target: "http://openartbrowser.org/"
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/artwork/Q683274"
      - get:
          url: "/artwork/Q15290965"
      - get:
          url: "/artwork/Q1810348"
      - get:
          url: "/api/_search?q=id:Q659396"
      - get:
          url: "/api/_search?q=id:Q4882378"
      - get:
          url: "/api/_search?q=id:Q1187408"